# FilterNumericGreater Properties

---
The FilterNumericGreater type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterNumericRuleEvaluator)
Top
#### Reference
FilterNumericGreater Class
Autodesk.Revit.DB Namespace